# Lyklaborð — curated modern-Icelandic supplementary vocabulary
# ("head of the long tail": high-frequency real words that BÍN doesn't contain
#  and that the icegrams corpus can't — brands, tech, anglicisms, colloquial.)
#
# This is a HAND-MAINTAINED list. Add words as the language moves.
# Format: one surface form per line, real display casing preserved
#   (matching is case-folded; the cased form is what's shown in the bar).
# Lines starting with '#' are comments; blank lines ignored.
# For words that inflect in Icelandic, list each surface form on its own line.
#
# Curation bar: mainstream, current, non-offensive. Prefer precision over
# recall — a wrong entry is worse than a gap. Redundant BÍN words are harmless
# (already valid) but omit them to keep the list focused.

# ── Global tech / apps / platforms ──────────────────────────────────────────
ChatGPT
OpenAI
GPT
Claude
Gemini
Copilot
Midjourney
TikTok
Instagram
Insta
Snapchat
WhatsApp
Messenger
Facebook
Threads
YouTube
Twitch
Netflix
Disney+
Spotify
SoundCloud
Twitter
Reddit
Discord
Telegram
Signal
LinkedIn
Pinterest
Google
Gmail
Android
Chrome
Safari
Firefox
Apple
iPhone
iPhone-inn
iPhoninn
iPad
iPadinn
iPod
iMac
MacBook
Mac
Macinn
AirPods
AirTag
iOS
macOS
watchOS
iCloud
FaceTime
iMessage
Siri
CarPlay
Microsoft
Windows
Xbox
PowerPoint
Outlook
Teams
OneDrive
Zoom
Slack
Notion
Figma
Canva
Dropbox
GitHub
GitLab
Amazon
AliExpress
eBay
Shein
Temu
PayPal
Revolut
Klarna
Tesla
Uber
Airbnb
Wolt
Bolt
PlayStation
Nintendo
Fortnite
Minecraft
Roblox
Wordle

# ── Tech acronyms / everyday abbreviations ──────────────────────────────────
Wi-Fi
Bluetooth
USB
HDMI
QR
QR-kóði
PDF
GIF
URL
VPN
AI
gervigreind
VR
AR
LED
GPS
SIM
SMS
5G
4G
HTML
CSS
API
CEO
DJ
NFT

# ── Icelandic brands / retail / companies ───────────────────────────────────
Bónus
Krónan
Nettó
Hagkaup
Costco
Fjarðarkaup
Melabúðin
Landsbankinn
Íslandsbanki
Arion
Kvika
Indó
Aur
Kass
Netgíró
Icelandair
Play
Strætó
Hopp
Síminn
Nova
Vodafone
Domino's
Serrano
Subway
Lemon
Íslandspóstur
Elko
Nova
Húsasmiðjan
BYKO
IKEA
Rúmfatalagerinn

# ── Icelandic media / institutions ──────────────────────────────────────────
RÚV
Stöð
Sýn
Vísir
mbl
Mbl.is
DV
Kjarninn
Heimildin
Vísindavefurinn
Bland
Alþingi
Landspítali
Landspítalinn
Vegagerðin
Skatturinn
RSK
Þjóðskrá
Ísland.is
Almannavarnir
Veðurstofan
Isavia
Landsvirkjun
Orkuveitan
Veitur
Háskólinn

# ── Tech / internet loan nouns & verbs (productive — inflected forms listed) ─
app
appið
appinu
appsins
öpp
öppin
podcast
podcastið
hlaðvarp
hlaðvarpið
hlaðvarpi
hlaðvarpsins
streyma
streymi
streymir
streymdi
streymt
deploya
deployaði
deployað
committa
committaði
committað
commit
pusha
pushaði
screenshot
skjáskot
skjáskotið
linkur
linkinn
linka
gúggla
gúgglaði
gúgglað
googla
emoji
emojii
emojið
meme
mím
influencer
selfie
selfí
selfíið
laptop
router
routerinn
account
account-ið
biotta
crossfit
gyminu
gym
podcastinn
imeil
meil

# ── Live slang / colloquial / interjections ─────────────────────────────────
okei
óke
okey
plís
pliss
hæ
hæhæ
halló
bæ
bæbæ
haha
hehe
lol
omg
btw
random
næs
næís
djók
djókaði
feik
chilla
chillaði
sjilla
meika
meikar
cringe
kúl
sjúkt
geggjað
mega
ógeðslega
væb
væbið
væbið
mood
flex
flexa
ghosta
ghostaði
simpa
bró
systa
dude
sus
bestie
lowkey
highkey

# ── Covid / recent-events era ───────────────────────────────────────────────
Covid
kóvid
korónuveiran
kórónuveira
grímuskylda
hraðpróf
Pfizer
Moderna
AstraZeneca
PCR

# ── Crypto / modern finance ─────────────────────────────────────────────────
Bitcoin
Ethereum
crypto
krypto
blockchain
